---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ObjectStyleMaterialIdParam
source: html/26294272-bc2e-7ab9-768b-802444c2011a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ObjectStyleMaterialIdParam Property

"Object Style Material"

## Syntax (C#)
```csharp
public static ForgeTypeId ObjectStyleMaterialIdParam { get; }
```